---
kind: other
id: Methods.T:Autodesk.Revit.DB.GridType
source: html/40f958f2-841f-eb13-f850-f72931ed46fe.htm
---
# GridType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.